// בקובץ זה נגדיר ראוטר ונייצא אותו החוצה
const router=require('express').Router();  // יצירת אובייקט של ראוטר המכיל את ההגדרות של הניתובים

// נהפונקציות שלנו שנמצאות בקונטרולר יש לשים לב לשמות הפונקציות לא משנה הסדר
const {
    Register,
    Login,
    GetAllUser,
    GetUserById,
    DeleteUser,
    UpdateUser
    }=require('../controller/user'); // נתיב בו נמצאות הפונקציות שלי

//---------------  ניתובים למשתמשים-----------------------
//-- יש ליזכור שאם אתה מגיע לפה אתה כבר מקבל '/user' ---

//--------ניתוב להרשמה-------------
router.post('/register',Register);
//----------------------------------

//-------ניתוב להתחברות-----------
router.post('/login',Login);
//----------------------------------

// ניתוב המחזיר את כל מוצרים 
router.get('/',GetAllUser);
//----------------------------------

// ניתוב המחזיר מוצר בודד לפי האיידי בפעולת GET
router.get('/:pid',GetUserById);
//----------------------------------

//-------ניתוב למחיקה של משתמש----
router.delete('/:pid',DeleteUser);
//----------------------------------

//-------ניתוב לעידכון של משתמש----
router.patch('/:pid',UpdateUser);
//----------------------------------

//----------------------ייצא-----------------------------
module.exports=router; // לייצא החוצה